docs/evidence/k6-failover.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6_failover.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * default: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  20.0s/20s

running (21.0s), 4/5 VUs, 56 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  20s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2500' p(95)=904.04ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 241     11.154823/s
    checks_succeeded...: 100.00% 241 out of 241
    checks_failed......: 0.00%   0 out of 241

    ✓ failure mode enabled
    ✓ failover load returns 200
    ✓ fallback provider selected
    ✓ provider registry remains reachable
    ✓ openai provider marked unhealthy

    HTTP
    http_req_duration..............: avg=375.77ms min=1.06ms med=8.32ms max=1.56s p(90)=810.57ms p(95)=904.04ms
      { expected_response:true }...: avg=375.77ms min=1.06ms med=8.32ms max=1.56s p(90)=810.57ms p(95)=904.04ms
    http_req_failed................: 0.00% 0 out of 123
    http_reqs......................: 123   5.693125/s

    EXECUTION
    iteration_duration.............: avg=1.77s    min=1.57s  med=1.7s   max=2.56s p(90)=1.91s    p(95)=2.45s   
    iterations.....................: 60    2.777134/s
    vus............................: 4     min=4        max=5
    vus_max........................: 5     min=5        max=5

    NETWORK
    data_received..................: 62 kB 2.9 kB/s
    data_sent......................: 24 kB 1.1 kB/s



running (21.6s), 0/5 VUs, 60 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  20s