docs/evidence/k6-stream.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6_stream.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * default: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  20.0s/20s

running (21.0s), 4/5 VUs, 36 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  20s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=2.03s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 80      3.689178/s
    checks_succeeded...: 100.00% 80 out of 80
    checks_failed......: 0.00%   0 out of 80

    ✓ streaming load returns 200
    ✓ stream contains done marker

    HTTP
    http_req_duration..............: avg=1.67s min=1.47s med=1.63s max=2.09s p(90)=1.98s p(95)=2.03s
      { expected_response:true }...: avg=1.67s min=1.47s med=1.63s max=2.09s p(90)=1.98s p(95)=2.03s
    http_req_failed................: 0.00% 0 out of 40
    http_reqs......................: 40    1.844589/s

    EXECUTION
    iteration_duration.............: avg=2.67s min=2.47s med=2.63s max=3.1s  p(90)=2.98s p(95)=3.03s
    iterations.....................: 40    1.844589/s
    vus............................: 4     min=4       max=5
    vus_max........................: 5     min=5       max=5

    NETWORK
    data_received..................: 85 kB 3.9 kB/s
    data_sent......................: 12 kB 548 B/s



running (21.7s), 0/5 VUs, 40 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  20s